<a href="https://colab.research.google.com/github/annLiu310/python-basic/blob/master/08_Pandas_DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [0]:
import pandas as pd
import numpy as np

In [0]:
from numpy.random import randn
np.random.seed(101)

In [7]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split(' '))
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [9]:
df['Z']

A    0.230336
B    1.939932
C   -0.732845
D   -2.141212
E    1.292765
Name: Z, dtype: float64

In [10]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A  0.386030  0.230336
B  0.681209  1.939932
C -1.005187 -0.732845
D -1.382920 -2.141212
E  0.992573  1.292765

In [0]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

DataFrame Columns are just Series

In [0]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [0]:
df['new'] = df['W'] + df['Y']

In [14]:
df

          W         X         Y         Z       new
A  0.386030  2.084019 -0.376519  0.230336  0.009512
B  0.681209  1.035125 -0.031160  1.939932  0.650049
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462
E  0.992573  1.192241 -1.046780  1.292765 -0.054206

** Removing Columns**

In [15]:
df.drop('new',axis=1)# need axis, and inplace to delete column

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [17]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A  0.386030  2.084019 -0.376519  0.230336  0.009512
B  0.681209  1.035125 -0.031160  1.939932  0.650049
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462
E  0.992573  1.192241 -1.046780  1.292765 -0.054206

In [0]:
df.drop('new',axis=1,inplace=True)

In [19]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

Can also drop rows this way:

In [22]:
df.drop('E')  # axis =0 by default

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212

** Selecting Rows**

In [25]:
# Get Row
df.loc['E']

W    0.992573
X    1.192241
Y   -1.046780
Z    1.292765
Name: E, dtype: float64

Or select based off of position instead of label

In [27]:
df.iloc[1:]

          W         X         Y         Z
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

** Selecting subset of rows and columns **

In [28]:
df.loc['B','Y']

-0.031160481493099617

In [37]:
# pass the rows and columns to select
df.loc[['A','B'],['W','X']]

          W         X
A  0.386030  2.084019
B  0.681209  1.035125

In [34]:
df.shape

(5, 4)

### Conditional Selection

Using bracket notation

In [30]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [43]:
bool_df=df>0.3
bool_df

       W      X      Y      Z
A   True   True  False  False
B   True   True  False   True
C  False  False  False  False
D  False   True   True  False
E   True   True  False   True

In [44]:
df[bool_df]

          W         X         Y         Z
A  0.386030  2.084019       NaN       NaN
B  0.681209  1.035125       NaN  1.939932
C       NaN       NaN       NaN       NaN
D       NaN  1.482495  0.961458       NaN
E  0.992573  1.192241       NaN  1.292765

In [48]:
# row condition
bool_df_w=df['W']>0
bool_df_w

A     True
B     True
C    False
D    False
E     True
Name: W, dtype: bool

In [50]:
# apply row condition
df[bool_df_w]

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
E  0.992573  1.192241 -1.046780  1.292765

In [54]:
result_df_z = df[df['Z']<0]
print(result_df_z['X'])
result_df_z

C   -0.741790
D    1.482495
Name: X, dtype: float64

          W         X         Y         Z
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212

In [0]:
df[df['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [57]:
df[df['W']>0][['Y','X']]

          Y         X
A -0.376519  2.084019
B -0.031160  1.035125
E -1.046780  1.192241

In [58]:
cols = ['Y','X']
df[df['W']>0][cols]

          Y         X
A -0.376519  2.084019
B -0.031160  1.035125
E -1.046780  1.192241

For two conditions you can use | and & with parenthesis:

In [62]:
# AND
df[(df['W']>-1) & (df['Y'] > -1)]

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932

In [64]:
#OR
df[(df['W']>-1) | (df['Y'] > -1)]

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [73]:
# Reset to numrical value default 0,1...n index
df.reset_index()

  index         W         X         Y         Z States
0     A  0.386030  2.084019 -0.376519  0.230336     CA
1     B  0.681209  1.035125 -0.031160  1.939932     NY
2     C -1.005187 -0.741790  0.187125 -0.732845     WY
3     D -1.382920  1.482495  0.961458 -2.141212     OR
4     E  0.992573  1.192241 -1.046780  1.292765     CO

In [70]:
newindex = 'CA NY WY OR CO'.split()
newindex

['CA', 'NY', 'WY', 'OR', 'CO']

In [74]:
# add new column and reset new column as index    df.set_index('States',inplace=True)
df['States'] = newindex
df['States']

A    CA
B    NY
C    WY
D    OR
E    CO
Name: States, dtype: object

In [0]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [75]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.386030  2.084019 -0.376519  0.230336
NY      0.681209  1.035125 -0.031160  1.939932
WY     -1.005187 -0.741790  0.187125 -0.732845
OR     -1.382920  1.482495  0.961458 -2.141212
CO      0.992573  1.192241 -1.046780  1.292765

In [76]:
df

          W         X         Y         Z States
A  0.386030  2.084019 -0.376519  0.230336     CA
B  0.681209  1.035125 -0.031160  1.939932     NY
C -1.005187 -0.741790  0.187125 -0.732845     WY
D -1.382920  1.482495  0.961458 -2.141212     OR
E  0.992573  1.192241 -1.046780  1.292765     CO

In [0]:
# need usd inplace
df.set_index('States',inplace=True)

In [78]:
df

               W         X         Y         Z
States
CA      0.386030  2.084019 -0.376519  0.230336
NY      0.681209  1.035125 -0.031160  1.939932
WY     -1.005187 -0.741790  0.187125 -0.732845
OR     -1.382920  1.482495  0.961458 -2.141212
CO      0.992573  1.192241 -1.046780  1.292765

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [0]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [81]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [83]:
hier_index
# G1- 0   G2 -1  ;  1 2 3   - 0 1 2

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [84]:
# create multi index data frame
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -1.467514 -0.494095
   2 -0.162535  0.485809
   3  0.392489  0.221491
G2 1 -0.855196  1.541990
   2  0.666319 -0.538235
   3 -0.568581  1.407338

 index hierarchy we use df.loc[]

In [97]:
df.loc['G1'] # it is a dataframe   type(df.loc['G1'] )

            A         B
Num
1   -1.467514 -0.494095
2   -0.162535  0.485809
3    0.392489  0.221491

In [0]:
df.loc['G1'].loc[1]

A    0.153661
B    0.167638
Name: 1, dtype: float64

In [90]:
# check index names
df.index.names

FrozenList([None, None])

In [94]:
df.index.names = ['Group','Num']  # outside name, inside name
df

                  A         B
Group Num
G1    1   -1.467514 -0.494095
      2   -0.162535  0.485809
      3    0.392489  0.221491
G2    1   -0.855196  1.541990
      2    0.666319 -0.538235
      3   -0.568581  1.407338

In [98]:
df.xs('G1') # same as df.loc['G1']

            A         B
Num
1   -1.467514 -0.494095
2   -0.162535  0.485809
3    0.392489  0.221491

In [99]:
df.xs(['G1',1])

A   -1.467514
B   -0.494095
Name: (G1, 1), dtype: float64

In [103]:
#get Cross section
df.xs(2,level='Num')

              A         B
Group
G1    -0.162535  0.485809
G2     0.666319 -0.538235